Revit 2027 API
AnalysisDisplayDeformedShapeSettings.GridColor Property
 Color of grid lines.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color GridColor { get; set; }
Public Property GridColor As Color
	Get
	Set
public:
property Color^ GridColor {
	Color^ get ();
	void set (Color^ value);
}
member GridColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace